{"contacts":[{"email":"hello@cmdrconf.com","twitter":"cmdrconf","name":"⌘R Conf"},{"email":"daniel@cmdrconf.com","twitter":"daniel1of1","phone_number":"+447999165400","name":"Daniel Haight"},{"email":"dominic@cmdrconf.com","twitter":"dominicfreeston","phone_number":"+447749747830","name":"Dominic Freeston"}],"speakers":[{"twitter":"chriseidhof","id":"chris_eidhof","image_url":"http://cmdrconf.com/assets/img/chriseidhof.jpg","links":["http://www.eidhof.nl","http://decksetapp.com/","http://www.uikonf.com/","http://www.objc.io/","http://www.objc.io/books/"],"name":"Chris Eidhof","summary":"Chris is a Dutch software developer living in Berlin (Germany). He spends most of his time building iOS and Mac apps, such as Deckset. He started UIKonf, objc.io, and wrote a book about Functional Programming in Swift."},{"twitter":"corbett","id":"christine_corbett","image_url":"http://cmdrconf.com/assets/img/corbett.jpg","links":["http://christinecorbettmoran.com","http://openwhispersystems.org/","http://www.circleof6app.com/","http://steamheavyindustries.com/"],"name":"Christine Corbett Moran","summary":"Dr. Corbett Moran co-leads the iOS development team at Open WhisperSystems, with a focus on TextSecure functionality. She powers Circle of 6 app, available on both iOS and Android, and Encyclopedia app available on iOS. She is an MIT graduate and Physics PhD with 11 years of software engineering experience and has been developing mobile applications for social good for the past 6 years. She daylights as a computational physicist at SpaceX, and hopes to go to Mars one day."},{"twitter":"ameaijou","id":"gwynne_raskind","image_url":"http://cmdrconf.com/assets/img/ameaijou.png","links":["http://www.darkrainfall.org"],"name":"Gwynne Raskind","summary":"Freelance OS X and iOS developer, Gwynne is the author of the upcoming 2nd edition of the standard-setting OS X Internals: A Systems Approach published by Pearson."},{"twitter":"dimsumthinking","id":"daniel_steinberg","image_url":"http://cmdrconf.com/assets/img/danielsteinberg.jpg","name":"Daniel Steinberg","summary":"Daniel Steinberg has spent the last three decades working as a professional Swift developer. OK, he hasn't. But he's really enjoying the Swift Programming Language. Daniel has been programming the iPhone and the iPad since the SDKs first appeared in beta and OS X for many years before. Daniel is the author of the books A Swift Kickstart and Developing iOS 7 Apps for iPad and iPhone, the official companion book to the popular iTunes U series from Stanford University taught by Paul Hegarty this past year."},{"twitter":"cocoafrog","id":"joachim_kurz","image_url":"http://cmdrconf.com/assets/img/Joachim_Kurz.jpg","name":"Joachim Kurz","summary":"Joachim studied computer science with a focus on Human-Computer-Interaction and the theory of programming languages. He sees programming languages and APIs as the User-Interface of a developer for interacting with the computer, which needs just as much attention to detail and great design as do the applications that are used by non-developers. At university he encountered the functional programming language Haskell and the logic programming language Prolog (besides many others) and he still misses features of both of these in his day-to-day work as iOS developer using Objective-C. Since Apple announced Swift he dove deep into the language studying every aspect of it and was happy to see many concepts from Haskell in the new language. Since then he started speaking publicly about interesting concepts in the Swift programming language, doing both a talk about an \"Introduction to Swift\" at CocoaHeads Cologne and a lightning talk about \"Laziness in Swift\" at iOSDevUK 2014. "},{"twitter":"merowing_","id":"krzysztof_zabłocki","image_url":"http://cmdrconf.com/assets/img/merowing_.jpg","links":["http://merowing.info"],"name":"Krzysztof Zabłocki","summary":"Author of @foldify, loves to share stuff related to iOS development, hacking things and simplifying workflows.\nCo-founder @madebypixle\nTech Lead at @LextechApps"},{"twitter":"kylefuller","id":"kyle_fuller","image_url":"http://cmdrconf.com/assets/img/KyleFuller.jpg","links":["http://kylefuller.co.uk"],"name":"Kyle Fuller","summary":"Kyle is a passionate programmer with a focus on quality. He currently works at Apiary focussing on the client side experience of communicating with APIs. Outside of his day job, he’s also an active contributor to many open-source projects in the iOS and OS X community including CocoaPods."},{"twitter":"mattjgalloway","id":"matt_galloway","image_url":"http://cmdrconf.com/assets/img/mattjgalloway.jpg","links":["http://www.galloway.me.uk"],"name":"Matt Galloway"},{"twitter":"CoderMay","id":"michael_may","image_url":"http://cmdrconf.com/assets/img/codermay.png","links":["https://www.linkedin.com/pub/michael-may/26/809/311"],"name":"Michael May","summary":"Software engineer, TEDx & AltTechTalks speaker, sometime DJ, commuter cyclist. I write apps for a living, drink coffee and ale for pleasure and live in London for both."},{"twitter":"bmf","id":"mike_lee","image_url":"http://cmdrconf.com/assets/img/bmf.jpg","links":["http://newlemurs.com"],"name":"Mike Lee","summary":"Mike Lee is an American engineer living in Amsterdam. He has worked with some interesting and even historic project teams, including such titles and company names as Delicious Monster, Tap Tap Revenge, Appsterdam, Obama '08, Black Pixel, Lemurs Chemistry, and Apple. He is currently studying terraforming."},{"twitter":"steipete","id":"peter_steinberger","image_url":"http://cmdrconf.com/assets/img/steipete.png","links":["http://petersteinberger.com"],"name":"Peter Steinberger","summary":"Peter is a developer and lately even more entrepreneur who's in the rare business of working full-time on an iOS framework with many high-profile customers like Dropbox or Evernote. He enjoys writing efficient code and speaks both business and objc runtime internals. He shares quite a bit of his work via open source. You might know him as @steipete on Twitter and from his work on PSPDFKit or Aspects."},{"twitter":"USA2DAY","id":"robin_christopherson","image_url":"http://cmdrconf.com/assets/img/usa2day.jpeg","links":["http://www.abilitynet.org.uk/robinchristopherson"],"name":"Robin Christopherson","summary":"After Cambridge University, Robin worked as an IT instructor for the Royal National Institute for the Blind (RNIB) and became a founding member of AbilityNet in 1998.  Now globally acclaimed as leading experts in the field, AbilityNet specialises in accessibility auditing and disabled user testing, as well as helping clients design attractive websites and apps that are both accessible and easy to use by all.\n\nDespite being blind, Robin uses technology very effectively using speech output to access computers, the internet, his iPhone and many other technologies to assist him in his work. Current projects include raising awareness through blogging and a busy public speaking schedule in the UK, Europe and the US."},{"twitter":"dirk_gently","id":"sam_marshall","image_url":"http://cmdrconf.com/assets/img/dirk_gently.jpg","links":["http://samdmarshall.com"],"name":"Sam Marshall","summary":"Samuel Marshall is an iOS and OS X Developer. Known for reverse engineering and breaking software. He is currently working on the second edition of “OS X Internals: A Systems Approach."},{"twitter":"supersole","id":"soledad_penades","image_url":"http://cmdrconf.com/assets/img/supersole.png","links":["http://soledadpenades.com"],"name":"Soledad Penadés","summary":"By day I work at Mozilla's Apps Engineering team, building and helping people build Open Web Apps. In my free time I like to write web API mashups, be them retro camera apps, generative music boxes, exploration games, or virtual oil canvas with positional audio driven by a physics simulation. I don't always end up building what I intend, and that's part of the fun!"},{"twitter":"mostgood","id":"sally_shepard","image_url":"http://cmdrconf.com/assets/img/SallyShepard.jpg","name":"Sally Shepard","summary":"Sally initially decided to study audio out of a love of music and tinkering with expensive hardware. Not satisfied with one degree in audio engineering, she embarked on a second, where she continued her weird obsession with microphones. She started working at the Apple Store the week the first iPhone launched, and immediately knew it was time to switch tracks and get a third degree. After completing a Masters in Software Engineering, she started working as an iOS developer at a digital agency, producing bespoke apps for well-known clients.\n\nShe currently works in London, where she is Head of App Development at Dennis Publishing, one of the world’s leading independent publishers. In her spare time she enjoys hacking, playing banjo and taking pictures with vintage cameras."},{"twitter":"cocoadelica","id":"rob_stearn","image_url":"http://cmdrconf.com/assets/img/RobStearn.jpg","name":"Rob Stearn","summary":"After zigzagging through careers from aircraft engineer to Apple store manager, I returned to my first love of writing code. It’s a long way from BASIC on a ZX Spectrum but now I’m an iOS and Mac developer, with a love for multipeer networking, drawing with code and the search for the perfect monospace font."},{"twitter":"mitchellallison","id":"mitchell_allison","image_url":"http://cmdrconf.com/assets/img/MitchellAllison.jpg","name":"Mitchell Allison","summary":"Mitchell Allison is a fourth year Computer Scientist from Imperial College London. In late 2013, he wrote WarningLights, an Xcode Plug-In that flashes your Philips Hue bulbs depending on the outcome of a build. After joining Apple as a Software Engineering Intern over Summer 2014 on an unrelated project to this talk, he’s back to London to finish off his degree."},{"id":"neil_kimmett","image_url":"http://cmdrconf.com/assets/img/NeilKimmett.jpg","name":"Neil Kimmett","summary":"Neil Kimmett used to be a scientist, studying Physics at university followed by a Masters in Scientific Computing. Nowadays the only lab you'll find him in is the Marks & Spencer Digital Labs (http://www.mslabs.io) where he is part of a crack team trying to push the boundaries of conventional retail. Most recently he released a recipe app called Cook With M&S (http://cookwithmands.com/) which was featured by Apple and hit #1 in the Food and Drink category of the App Store. In his spare time he enjoys tea, cycling and climbing walls."}],"sessions":[{"end_time":"2014-10-21T17:00:00+01:00","session_type":"workshop","venue":"america_square","id":"swift_kickstart","summary":"This is a separate event that requires a separate ticket. The Swift Kickstart is a one-day introduction to the Swift programming language for experienced programmers. It acts as a companion to the Swift Kickstart book.","start_time":"2014-10-21T10:00:00+01:00","title":"Swift Kickstart","speakers":["daniel_steinberg"]},{"venue":"shoreditchvillagehall","id":"registration1","title":"Open Door, Coffee and Registration","session_type":"break","end_time":"2014-10-22T10:00:00+01:00","start_time":"2014-10-22T09:00:00+01:00"},{"venue":"shoreditchvillagehall","id":"housekeeping1","title":"Welcome and Housekeeping","session_type":"talk","end_time":"2014-10-22T10:10:00+01:00","start_time":"2014-10-22T10:00:00+01:00"},{"end_time":"2014-10-22T10:50:00+01:00","session_type":"talk","venue":"shoreditchvillagehall","id":"hard_ideas","summary":"Sitting in front of a computer for days, understanding the complexity of the system well enough to communicate with the machine and solve problems, you might start seeing parallels with other complex systems, and wondering if you can fix problems there too. Call it the spiritual side of programming.\n\nWe talk about changing the world, about making a dent in the universe, about doing anything we can to bring the future faster—but are we? And to what end? Sometimes it's not the work that is hardest, but the questions around the work—ethical, philosophical, even existential questions.\nFor those whose love of comfort is outweighed by their compulsive need to dig deeper, to find the hardest problems, to tease them out, and to attempt the impossible, we will delve into questions like these, \"not because they are easy, but because they are hard.”","title":"Hard Ideas","start_time":"2014-10-22T10:10:00+01:00","speakers":["mike_lee"]},{"end_time":"2014-10-22T11:30:00+01:00","session_type":"talk","venue":"shoreditchvillagehall","id":"steinberg_talk","summary":"Functions are the key to getting the most out of modern iOS programming in Swift. Building on the fundamentals of functions in C and blocks in Objective-C, Swift functions have the power and flexibility that will make your inner LISPer smile. This session takes you from Hello World to closures. We look at functions that range from those with the simplest of signatures to those that take advantage of generics.","title":"What the func?","start_time":"2014-10-22T10:50:00+01:00","speakers":["daniel_steinberg"]},{"end_time":"2014-10-22T13:20:00+01:00","session_type":"talk","venue":"shoreditchvillagehall","id":"coredata","summary":"This talk is going to cover Apple framework for persistence and object graph management, Core Data. It will demonstrate the best practises for working with Core Data along with some tips on how to get the most out of the framework. Going into details on how to efficiently use Core Data, and avoiding common problems and road blocks.","title":"ICYMI: Core Data","start_time":"2014-10-22T12:40:00+01:00","speakers":["kyle_fuller"]},{"id":"coffeebreak1","title":"Coffee Break","session_type":"break","end_time":"2014-10-22T12:00:00+01:00","start_time":"2014-10-22T11:30:00+01:00"},{"end_time":"2014-10-23T13:20:00+01:00","session_type":"talk","venue":"shoreditchvillagehall","id":"assembly101","summary":"Almost every line of code executed by a computer was translated into assembly language before it got to the CPU. But many programmers can neither write nor read this arcane and often byzantine tongue. Join this session for a tour of reading opcodes and writing assembler, and learn just why this should matter to you as a high-level programmer in a modern world. Both Intel and ARM instruction sets will be covered.","title":"The Why and How of Assembly Language","start_time":"2014-10-23T12:40:00+01:00","speakers":["gwynne_raskind"]},{"end_time":"2014-10-23T13:20:00+01:00","session_type":"talk","venue":"shoreditchvillagehall","id":"character_encoding","summary":"You've heard of string. You may even have heard about Unicode and UTF-8. But do you really know why they matter to us as developers? In this talk I'll explain the concepts and show how they make their way into Swift and Foundation.","title":"Strings: From 0 to 🐓🍟","start_time":"2014-10-23T12:40:00+01:00","speakers":["matt_galloway"]},{"id":"lunchbreak1","title":"Lunch","session_type":"break","end_time":"2014-10-22T15:00:00+01:00","start_time":"2014-10-22T13:20:00+01:00"},{"end_time":"2014-10-22T15:40:00+01:00","session_type":"talk","venue":"shoreditchvillagehall","id":"lightning_talks1","summary":"Neil Kimmett - Lessons learned from cooking up an app.  Rob Stearn - Who's afraid of auto layout?","title":"Lightning Talks","start_time":"2014-10-22T15:00:00+01:00","speakers":["neil_kimmett","rob_stearn"]},{"end_time":"2014-10-22T12:40:00+01:00","session_type":"talk","venue":"shoreditchvillagehall","id":"lazy_swift","summary":"Lazy Evaluation is a useful concept in computer science, as it allows a value to be calculated only at the time when it is needed. Often a value is never used, thus the computation is saved completely. But lazy evaluation not only has the potential to save unnecessary computations, it also increases the expressiveness of a language, for example by making it possible to handle infinite data structures. This talk will present different ways to implement and use lazy evaluation in Swift, including the @auto_closure attribute to delay the evaluation of arguments to a function, lazy properties in objects and structures, and the handling of lazy collections (even infinite ones) using the lazy() function in the Swift standard library.","title":"Laziness in Swift","start_time":"2014-10-22T12:00:00+01:00","speakers":["joachim_kurz"]},{"id":"coffeebreak2","title":"Coffee Break","end_time":"2014-10-22T17:00:00+01:00","start_time":"2014-10-22T16:20:00+01:00","session_type":"break"},{"id":"coffeebreak4","title":"Coffee Break","end_time":"2014-10-23T17:00:00+01:00","session_type":"break","start_time":"2014-10-23T16:20:00+01:00"},{"end_time":"2014-10-22T16:20:00+01:00","session_type":"talk","venue":"shoreditchvillagehall","id":"accessibility","summary":"Robin Christopherson, of the leading UK inclusive tech experts AbilityNet, will challenge any preconceptions you may have about the potential of technology. Being blind himself he provides us with an excellent first-hand example of the choices we can provide for every user if we simply design with an eye for inclusion. Robin will be talking about (but more importantly demonstrating) a range of inclusive technology and how it has the power to change and even transform people's lives regardless of ability or environment. Will you be part of the Everybody Technology future?","title":"Technology - The Power and the Promise","start_time":"2014-10-22T15:40:00+01:00","speakers":["robin_christopherson"]},{"venue":"shoreditchvillagehall","id":"registration2","title":"Open Door and Coffee","end_time":"2014-10-23T10:00:00+01:00","session_type":"break","start_time":"2014-10-23T09:00:00+01:00"},{"venue":"shoreditchvillagehall","id":"housekeeping2","title":"Welcome and Housekeeping","session_type":"talk","end_time":"2014-10-23T10:10:00+01:00","start_time":"2014-10-23T10:00:00+01:00"},{"end_time":"2014-10-23T12:40:00+01:00","session_type":"talk","venue":"shoreditchvillagehall","id":"code_signing","summary":"A deep dive into the provisioning and code-signing process. How provisioning profiles are create, what information do they dictate to iOS devices, what is “code-signing” what benefits does it provide, how are code signatures stored, and what are code signatures used for. This talk aims to demystify the process behind one of the more convoluted processes in development.","title":"Everything is Terrible","start_time":"2014-10-23T12:00:00+01:00","speakers":["sam_marshall"]},{"end_time":"2014-10-23T11:30:00+01:00","session_type":"talk","venue":"shoreditchvillagehall","id":"functional_swift","summary":"I'll be talking about how we can use Swift's capabilities to do functional programming. I'll show how to solve some problems in a functional way, and will explain why this is interesting.","title":"Functional Swift","start_time":"2014-10-23T10:50:00+01:00","speakers":["chris_eidhof"]},{"id":"coffeebreak3","title":"Coffee Break","end_time":"2014-10-23T12:00:00+01:00","start_time":"2014-10-23T11:30:00+01:00","session_type":"break"},{"end_time":"2014-10-23T10:50:00+01:00","session_type":"talk","venue":"shoreditchvillagehall","id":"empower_objc","summary":"Objective-C is far from dead, so here's ways to improve the quality of your code by leveraging lesser known features of Objective-C and LLVM.","start_time":"2014-10-23T10:10:00+01:00","title":"Empower your Objective-C","speakers":["krzysztof_zabłocki"]},{"end_time":"2014-10-22T18:20:00+01:00","session_type":"talk","venue":"shoreditchvillagehall","id":"steinberger_talk","summary":"Based on his own company, Peter talks about lessons learned on scaling a one-person shop to 15 people and beyond. We're moving across many aspects of running a business, from organizing over building a product to hiring&firing - and of course there'll be some great stories along the way.","title":"Scaling Your Indie Business","start_time":"2014-10-22T17:40:00+01:00","speakers":["peter_steinberger"]},{"id":"lunchbreak2","title":"Lunch","end_time":"2014-10-23T15:00:00+01:00","session_type":"break","start_time":"2014-10-23T13:20:00+01:00"},{"end_time":"2014-10-23T15:40:00+01:00","session_type":"talk","venue":"shoreditchvillagehall","id":"lightning_talks2","summary":"Mitchell Allison - Compiling Swift with Swift... and other bad ideas.  Sally Shepard - Psychoacoustics and Auditory Illusions for App Development","title":"Lightning Talks","start_time":"2014-10-23T15:00:00+01:00","speakers":["mitchell_allison","sally_shepard"]},{"end_time":"2014-10-23T16:20:00+01:00","session_type":"talk","venue":"shoreditchvillagehall","id":"monocultural","summary":"\"She's just a kid\"\n\"He won't fit in with our culture\"\n\nWithin five years many of you will be changing decade age. Some starting their twenties, many their thirties and forties, some, their fifties.\n\nAs each year passes, the chance that you will be working with someone who is significantly younger than you, increases. But this can also be stated as; as each year passes, the chance that you will be working with someone who is significantly older than you, decreases. Why is that?\n\nHumanity has always been strongest when it is diverse. Monocultures are a weakness that nature destroys through evolution. Yet our community often favours a monoculture; young, white, males.\n\nThis is not a talk about ageism, this is about diversity, with a focus on age, in our community and what we can do to embrace it and make us stronger.","title":"Monocultural","start_time":"2014-10-23T15:40:00+01:00","speakers":["michael_may"]},{"end_time":"2014-10-23T18:20:00+01:00","session_type":"talk","venue":"shoreditchvillagehall","id":"embracing_failure","summary":"Most talks at conferences focus on the successful tech stories: how we built something, why library A is better than library B, or perhaps how to get the most FPS in your web game. These are just a few examples, and often the presenter glosses over or ignores altogether the grittiness of their struggles: the frustration when things don't quite work as they intend them to work, and the endless days of procrastination to unconsciously avoid failure.\n\nEveryone wants to be a code hero, but real heroes are not born from walking an easy path. They are born from struggle, from facing their fears and turning them into strengths. So I'll teach you how you can be a code hero too, by telling failure from progress, identifying errors and embracing them as part of your creative process.","title":"Embracing Failure","start_time":"2014-10-23T17:40:00+01:00","speakers":["soledad_penades"]},{"summary":"In this talk I will discuss the challenges and joys of developing an open source iOS app including challenges of community participation, design, code review, code conventions, compliance, revenue, and more. I will talk about the security and community benefits that can come from an open source model and give some concrete examples straight from the source.","session_type":"talk","venue":"shoreditchvillagehall","id":"open_source_ios","end_time":"2014-10-23T17:40:00+01:00","title":"Open Source iOS","start_time":"2014-10-23T17:00:00+01:00","speakers":["christine_corbett"]},{"venue":"lyst_studios","id":"hackday","title":"Hack Day","session_type":"hack","end_time":"2014-10-24T17:30:00+01:00","start_time":"2014-10-24T10:00:00+01:00"}],"news":[{"title":"Thank you!","summary":"We're very happy that you'll be attending ⌘R Conf. We've got an exciting programme of speakers and workshops, as well as some fun social events in the evenings. We hope you have a good time. If you need to contact us about anything, please see the information tab of this app."}],"venues":[{"summary":"The Village Hall, situated in London’s iconic Hoxton Square, is the perfect place for hosting exceptional events, with an auditorium large enough to hold 200 people seated, and two spacious break-out rooms; it is the perfect place to hold conferences, performances, hackathons, training, product launches, exhibitions, T.V & Location filming, and more. ","id":"shoreditchvillagehall","address":"33 Hoxton Square, N1 6NN","image_url":"","name":"Shoreditch Village Hall","coordinates":"51.527605, -0.080866"},{"coordinates":"51.527292,-0.081363","id":"lyst_studios","image_url":"","name":"Lyst Studios","address":"48 Hoxton Square, N1 6PB"},{"address":"1 America Square, 17 Croswall, EC3N 2LB","id":"america_square","image_url":"","name":"America Square Conference Centre","coordinates":"51.511473,-0.076839"}],"sponsors":[{"id":"facebook","links":["http://www.facebook.com"],"image_url":"http://cmdrconf.com/assets/img/facebook.png","name":"Facebook"},{"id":"badoo","links":["http://badoo.com"],"image_url":"http://cmdrconf.com/assets/img/badoo.png","name":"Badoo"},{"id":"lyst","links":["http://lyst.com"],"image_url":"http://cmdrconf.com/assets/img/lyst.png","name":"Lyst"},{"id":"shinobi","links":["http://www.shinobicontrols.com"],"image_url":"http://cmdrconf.com/assets/img/shinobi.png","name":"ShinobiControls"}]}